Repository: DM-YavuzCakmak/TixxpApplication
Catalog: TixxpWebApp/Resources/Controllers/PersonnelController.*.resx
Languages: tr_tr

# personnel.INDEX.PAGE_TITLE
source: Personnel Management
tr_tr: Personel Yönetimi

# personnel.INDEX.NEW_USER
source: New Personnel
tr_tr: Yeni Personel

# personnel.INDEX.TABLE_TITLE
source: Personnel List
tr_tr: Personel Listesi

# personnel.INDEX.FIRST_NAME
source: First Name
tr_tr: Ad

# personnel.INDEX.LAST_NAME
source: Last Name
tr_tr: Soyad

# personnel.INDEX.EMAIL
source: Email
tr_tr: E-posta

# personnel.INDEX.ACTION
source: Actions
tr_tr: İşlemler

# personnel.INDEX.NO_RECORD
source: No records found.
tr_tr: Kayıt bulunamadı.

# personnel.INDEX.HIERARCHY_TITLE
source: Company Hierarchy
tr_tr: Şirket Hiyerarşisi

# personnel.INDEX.HIERARCHY_ERROR
source: Failed to load hierarchy data.
tr_tr: Hiyerarşi yüklenirken hata oluştu.

# personnel.INDEX.HIERARCHY_LOADING
source: Loading information...
tr_tr: Bilgiler yükleniyor...

# personnel.INDEX.BUBBLE_ERROR
source: User information could not be loaded.
tr_tr: Kullanıcı bilgileri getirilemedi.

# personnel.INDEX.ROLES_OF_USER
source: User Roles
tr_tr: Kullanıcının Rolleri

# personnel.INDEX.USER_INFO
source: Personnel Information
tr_tr: Personel Bilgileri

# personnel.INDEX.FIRST_NAME_LABEL
source: First Name
tr_tr: Ad

# personnel.INDEX.LAST_NAME_LABEL
source: Last Name
tr_tr: Soyad

# personnel.INDEX.EMAIL_LABEL
source: Email
tr_tr: E-posta

# personnel.INDEX.PHONE_LABEL
source: Phone
tr_tr: Telefon

# personnel.INDEX.PASSWORD_LABEL
source: Password
tr_tr: Parola

# personnel.INDEX.SAVE
source: Save
tr_tr: Kaydet

# personnel.INDEX.ASSIGN_ROLE
source: Assign Role
tr_tr: Rol Ata

# personnel.INDEX.SHOW_ROLES
source: Show Roles
tr_tr: Rolleri Göster

# personnel.INDEX.SELECT_ROLE
source: Select Role
tr_tr: Rol Seç

# personnel.INDEX.SELECT_ROLE_PLACEHOLDER
source: Please select a role
tr_tr: Rol seçiniz

# personnel.INDEX.NO_ROLE_FOUND
source: No roles found.
tr_tr: Rol bulunamadı.

# personnel.INDEX.DELETE_CONFIRM_TITLE
source: Are you sure?
tr_tr: Emin misiniz?

# personnel.INDEX.DELETE_CONFIRM_TEXT
source: This user will be deleted.
tr_tr: Bu kullanıcı silinecektir.

# personnel.INDEX.DELETE_CONFIRM_YES
source: Yes
tr_tr: Evet

# personnel.INDEX.DELETE_CONFIRM_CANCEL
source: Cancel
tr_tr: Vazgeç

# personnel.INDEX.DELETED
source: Deleted
tr_tr: Silindi

# personnel.ERROR.NOT_FOUND
source: User not found.
tr_tr: Kullanıcı bulunamadı.

# personnel.ERROR.MODEL_INVALID
source: Invalid form information. Please check the fields.
tr_tr: Geçersiz form bilgisi. Lütfen alanları kontrol edin.

# personnel.ERROR.EMAIL_INVALID
source: Please enter a valid email address.
tr_tr: Geçerli bir e-posta adresi giriniz.

# personnel.ERROR.PHONE_INVALID
source: Phone number must be exactly 10 digits.
tr_tr: Telefon numarası 10 haneli olmalıdır.

# personnel.ERROR.PASSWORD_REQUIRED
source: Password is required.
tr_tr: Parola zorunludur.

# personnel.ERROR.SAVE_FAILED
source: An error occurred while saving the user.
tr_tr: Kayıt sırasında hata oluştu.

# personnel.ERROR.DELETE_FAILED
source: An error occurred while deleting the user.
tr_tr: Silme işlemi sırasında hata oluştu.

# personnel.ERROR.INVALID_ID
source: Invalid user or role information.
tr_tr: Geçersiz kullanıcı veya rol bilgisi.

# personnel.ERROR.ROLE_NOT_FOUND
source: Role not found.
tr_tr: Rol bulunamadı.

# personnel.ERROR.ROLE_ALREADY_ASSIGNED
source: User already has this role.
tr_tr: Kullanıcı zaten bu role sahip.

# personnel.ERROR.ROLE_ASSIGN_FAILED
source: An error occurred while assigning the role.
tr_tr: Rol atanırken hata oluştu.

# personnel.SUCCESS.SAVED
source: User has been successfully saved.
tr_tr: Kullanıcı başarıyla kaydedildi.

# personnel.SUCCESS.DELETED
source: User has been successfully deleted.
tr_tr: Kullanıcı başarıyla silindi.

# personnel.SUCCESS.ROLE_ASSIGNED
source: Role has been successfully assigned.
tr_tr: Rol başarıyla atandı.
